zephyrproject-rtos/hal_silabs/simplicity_sdk/platform/Device/SiliconLabs/EFR32MG29/Include/efr32mg29_dcdc.h
/* Bit fields for DCDC CTRL */
#define _DCDC_CTRL_RESETVALUE                         0x00000040UL                              /**< Default value for DCDC_CTRL                 */
#define _DCDC_CTRL_MASK                               0x0000CF71UL                              /**< Mask for DCDC_CTRL                          */
#define DCDC_CTRL_MODE                                (0x1UL << 0)                              /**< DCDC/Bypass Mode Control                    */
#define _DCDC_CTRL_MODE_SHIFT                         0                                         /**< Shift value for DCDC_MODE                   */
#define _DCDC_CTRL_MODE_MASK                          0x1UL                                     /**< Bit mask for DCDC_MODE                      */
#define _DCDC_CTRL_MODE_DEFAULT                       0x00000000UL                              /**< Mode DEFAULT for DCDC_CTRL                  */
#define _DCDC_CTRL_MODE_BYPASS                        0x00000000UL                              /**< Mode BYPASS for DCDC_CTRL                   */
#define _DCDC_CTRL_MODE_DCDCREGULATION                0x00000001UL                              /**< Mode DCDCREGULATION for DCDC_CTRL           */
#define DCDC_CTRL_MODE_DEFAULT                        (_DCDC_CTRL_MODE_DEFAULT << 0)            /**< Shifted mode DEFAULT for DCDC_CTRL          */
#define DCDC_CTRL_MODE_BYPASS                         (_DCDC_CTRL_MODE_BYPASS << 0)             /**< Shifted mode BYPASS for DCDC_CTRL           */
#define DCDC_CTRL_MODE_DCDCREGULATION                 (_DCDC_CTRL_MODE_DCDCREGULATION << 0)     /**< Shifted mode DCDCREGULATION for DCDC_CTRL   */
#define _DCDC_CTRL_IPKTMAXCTRL_SHIFT                  4                                         /**< Shift value for DCDC_IPKTMAXCTRL            */
#define _DCDC_CTRL_IPKTMAXCTRL_MASK                   0x70UL                                    /**< Bit mask for DCDC_IPKTMAXCTRL               */
#define _DCDC_CTRL_IPKTMAXCTRL_DEFAULT                0x00000004UL                              /**< Mode DEFAULT for DCDC_CTRL                  */
#define _DCDC_CTRL_IPKTMAXCTRL_OFF                    0x00000000UL                              /**< Mode OFF for DCDC_CTRL                      */
#define _DCDC_CTRL_IPKTMAXCTRL_TMAX_0P35us            0x00000001UL                              /**< Mode TMAX_0P35us for DCDC_CTRL              */
#define _DCDC_CTRL_IPKTMAXCTRL_TMAX_0P63us            0x00000002UL                              /**< Mode TMAX_0P63us for DCDC_CTRL              */
#define _DCDC_CTRL_IPKTMAXCTRL_TMAX_0P91us            0x00000003UL                              /**< Mode TMAX_0P91us for DCDC_CTRL              */
#define _DCDC_CTRL_IPKTMAXCTRL_TMAX_1P19us            0x00000004UL                              /**< Mode TMAX_1P19us for DCDC_CTRL              */
#define _DCDC_CTRL_IPKTMAXCTRL_TMAX_1P47us            0x00000005UL                              /**< Mode TMAX_1P47us for DCDC_CTRL              */
#define _DCDC_CTRL_IPKTMAXCTRL_TMAX_1P75us            0x00000006UL                              /**< Mode TMAX_1P75us for DCDC_CTRL              */
#define _DCDC_CTRL_IPKTMAXCTRL_TMAX_2P03us            0x00000007UL                              /**< Mode TMAX_2P03us for DCDC_CTRL              */
#define DCDC_CTRL_IPKTMAXCTRL_DEFAULT                 (_DCDC_CTRL_IPKTMAXCTRL_DEFAULT << 4)     /**< Shifted mode DEFAULT for DCDC_CTRL          */
#define DCDC_CTRL_IPKTMAXCTRL_OFF                     (_DCDC_CTRL_IPKTMAXCTRL_OFF << 4)         /**< Shifted mode OFF for DCDC_CTRL              */
#define DCDC_CTRL_IPKTMAXCTRL_TMAX_0P35us             (_DCDC_CTRL_IPKTMAXCTRL_TMAX_0P35us << 4) /**< Shifted mode TMAX_0P35us for DCDC_CTRL      */
#define DCDC_CTRL_IPKTMAXCTRL_TMAX_0P63us             (_DCDC_CTRL_IPKTMAXCTRL_TMAX_0P63us << 4) /**< Shifted mode TMAX_0P63us for DCDC_CTRL      */
#define DCDC_CTRL_IPKTMAXCTRL_TMAX_0P91us             (_DCDC_CTRL_IPKTMAXCTRL_TMAX_0P91us << 4) /**< Shifted mode TMAX_0P91us for DCDC_CTRL      */
#define DCDC_CTRL_IPKTMAXCTRL_TMAX_1P19us             (_DCDC_CTRL_IPKTMAXCTRL_TMAX_1P19us << 4) /**< Shifted mode TMAX_1P19us for DCDC_CTRL      */
#define DCDC_CTRL_IPKTMAXCTRL_TMAX_1P47us             (_DCDC_CTRL_IPKTMAXCTRL_TMAX_1P47us << 4) /**< Shifted mode TMAX_1P47us for DCDC_CTRL      */
#define DCDC_CTRL_IPKTMAXCTRL_TMAX_1P75us             (_DCDC_CTRL_IPKTMAXCTRL_TMAX_1P75us << 4) /**< Shifted mode TMAX_1P75us for DCDC_CTRL      */
#define DCDC_CTRL_IPKTMAXCTRL_TMAX_2P03us             (_DCDC_CTRL_IPKTMAXCTRL_TMAX_2P03us << 4) /**< Shifted mode TMAX_2P03us for DCDC_CTRL      */
#define _DCDC_CTRL_DVDDBSTPRG_SHIFT                   8                                         /**< Shift value for DCDC_DVDDBSTPRG             */
#define _DCDC_CTRL_DVDDBSTPRG_MASK                    0xF00UL                                   /**< Bit mask for DCDC_DVDDBSTPRG                */
#define _DCDC_CTRL_DVDDBSTPRG_DEFAULT                 0x00000000UL                              /**< Mode DEFAULT for DCDC_CTRL                  */
#define _DCDC_CTRL_DVDDBSTPRG_BOOST_1V8               0x00000000UL                              /**< Mode BOOST_1V8 for DCDC_CTRL                */
#define _DCDC_CTRL_DVDDBSTPRG_BOOST_1V9               0x00000001UL                              /**< Mode BOOST_1V9 for DCDC_CTRL                */
#define _DCDC_CTRL_DVDDBSTPRG_BOOST_2V                0x00000002UL                              /**< Mode BOOST_2V for DCDC_CTRL                 */
#define _DCDC_CTRL_DVDDBSTPRG_BOOST_2V1               0x00000003UL                              /**< Mode BOOST_2V1 for DCDC_CTRL                */
#define _DCDC_CTRL_DVDDBSTPRG_BOOST_2V2               0x00000004UL                              /**< Mode BOOST_2V2 for DCDC_CTRL                */
#define _DCDC_CTRL_DVDDBSTPRG_BOOST_2V3               0x00000005UL                              /**< Mode BOOST_2V3 for DCDC_CTRL                */
#define _DCDC_CTRL_DVDDBSTPRG_BOOST_2V4               0x00000006UL                              /**< Mode BOOST_2V4 for DCDC_CTRL                */
#define DCDC_CTRL_DVDDBSTPRG_DEFAULT                  (_DCDC_CTRL_DVDDBSTPRG_DEFAULT << 8)      /**< Shifted mode DEFAULT for DCDC_CTRL          */
#define DCDC_CTRL_DVDDBSTPRG_BOOST_1V8                (_DCDC_CTRL_DVDDBSTPRG_BOOST_1V8 << 8)    /**< Shifted mode BOOST_1V8 for DCDC_CTRL        */
#define DCDC_CTRL_DVDDBSTPRG_BOOST_1V9                (_DCDC_CTRL_DVDDBSTPRG_BOOST_1V9 << 8)    /**< Shifted mode BOOST_1V9 for DCDC_CTRL        */
#define DCDC_CTRL_DVDDBSTPRG_BOOST_2V                 (_DCDC_CTRL_DVDDBSTPRG_BOOST_2V << 8)     /**< Shifted mode BOOST_2V for DCDC_CTRL         */
#define DCDC_CTRL_DVDDBSTPRG_BOOST_2V1                (_DCDC_CTRL_DVDDBSTPRG_BOOST_2V1 << 8)    /**< Shifted mode BOOST_2V1 for DCDC_CTRL        */
#define DCDC_CTRL_DVDDBSTPRG_BOOST_2V2                (_DCDC_CTRL_DVDDBSTPRG_BOOST_2V2 << 8)    /**< Shifted mode BOOST_2V2 for DCDC_CTRL        */
#define DCDC_CTRL_DVDDBSTPRG_BOOST_2V3                (_DCDC_CTRL_DVDDBSTPRG_BOOST_2V3 << 8)    /**< Shifted mode BOOST_2V3 for DCDC_CTRL        */
#define DCDC_CTRL_DVDDBSTPRG_BOOST_2V4                (_DCDC_CTRL_DVDDBSTPRG_BOOST_2V4 << 8)    /**< Shifted mode BOOST_2V4 for DCDC_CTRL        */
#define DCDC_CTRL_FORCEBIAS                           (0x1UL << 14)                             /**< Force Comparators to be biased              */
#define _DCDC_CTRL_FORCEBIAS_SHIFT                    14                                        /**< Shift value for DCDC_FORCEBIAS              */
#define _DCDC_CTRL_FORCEBIAS_MASK                     0x4000UL                                  /**< Bit mask for DCDC_FORCEBIAS                 */
#define _DCDC_CTRL_FORCEBIAS_DEFAULT                  0x00000000UL                              /**< Mode DEFAULT for DCDC_CTRL                  */
#define DCDC_CTRL_FORCEBIAS_DEFAULT                   (_DCDC_CTRL_FORCEBIAS_DEFAULT << 14)      /**< Shifted mode DEFAULT for DCDC_CTRL          */
#define DCDC_CTRL_FIXEDEMBIAS                         (0x1UL << 15)                             /**< Force EM2 config settings                   */
#define _DCDC_CTRL_FIXEDEMBIAS_SHIFT                  15                                        /**< Shift value for DCDC_FIXEDEMBIAS            */
#define _DCDC_CTRL_FIXEDEMBIAS_MASK                   0x8000UL                                  /**< Bit mask for DCDC_FIXEDEMBIAS               */
#define _DCDC_CTRL_FIXEDEMBIAS_DEFAULT                0x00000000UL                              /**< Mode DEFAULT for DCDC_CTRL                  */
#define DCDC_CTRL_FIXEDEMBIAS_DEFAULT                 (_DCDC_CTRL_FIXEDEMBIAS_DEFAULT << 15)    /**< Shifted mode DEFAULT for DCDC_CTRL          */

/* Bit fields for DCDC EM01CTRL0 */
#define _DCDC_EM01CTRL0_RESETVALUE                    0x00000109UL                                    /**< Default value for DCDC_EM01CTRL0            */
#define _DCDC_EM01CTRL0_MASK                          0x0000030FUL                                    /**< Mask for DCDC_EM01CTRL0                     */
#define _DCDC_EM01CTRL0_IPKVAL_SHIFT                  0                                               /**< Shift value for DCDC_IPKVAL                 */
#define _DCDC_EM01CTRL0_IPKVAL_MASK                   0xFUL                                           /**< Bit mask for DCDC_IPKVAL                    */
#define _DCDC_EM01CTRL0_IPKVAL_DEFAULT                0x00000009UL                                    /**< Mode DEFAULT for DCDC_EM01CTRL0             */
#define _DCDC_EM01CTRL0_IPKVAL_Load36mA               0x00000003UL                                    /**< Mode Load36mA for DCDC_EM01CTRL0            */
#define _DCDC_EM01CTRL0_IPKVAL_Load40mA               0x00000004UL                                    /**< Mode Load40mA for DCDC_EM01CTRL0            */
#define _DCDC_EM01CTRL0_IPKVAL_Load44mA               0x00000005UL                                    /**< Mode Load44mA for DCDC_EM01CTRL0            */
#define _DCDC_EM01CTRL0_IPKVAL_Load48mA               0x00000006UL                                    /**< Mode Load48mA for DCDC_EM01CTRL0            */
#define _DCDC_EM01CTRL0_IPKVAL_Load52mA               0x00000007UL                                    /**< Mode Load52mA for DCDC_EM01CTRL0            */
#define _DCDC_EM01CTRL0_IPKVAL_Load56mA               0x00000008UL                                    /**< Mode Load56mA for DCDC_EM01CTRL0            */
#define _DCDC_EM01CTRL0_IPKVAL_Load60mA               0x00000009UL                                    /**< Mode Load60mA for DCDC_EM01CTRL0            */
#define DCDC_EM01CTRL0_IPKVAL_DEFAULT                 (_DCDC_EM01CTRL0_IPKVAL_DEFAULT << 0)           /**< Shifted mode DEFAULT for DCDC_EM01CTRL0     */
#define DCDC_EM01CTRL0_IPKVAL_Load36mA                (_DCDC_EM01CTRL0_IPKVAL_Load36mA << 0)          /**< Shifted mode Load36mA for DCDC_EM01CTRL0    */
#define DCDC_EM01CTRL0_IPKVAL_Load40mA                (_DCDC_EM01CTRL0_IPKVAL_Load40mA << 0)          /**< Shifted mode Load40mA for DCDC_EM01CTRL0    */
#define DCDC_EM01CTRL0_IPKVAL_Load44mA                (_DCDC_EM01CTRL0_IPKVAL_Load44mA << 0)          /**< Shifted mode Load44mA for DCDC_EM01CTRL0    */
#define DCDC_EM01CTRL0_IPKVAL_Load48mA                (_DCDC_EM01CTRL0_IPKVAL_Load48mA << 0)          /**< Shifted mode Load48mA for DCDC_EM01CTRL0    */
#define DCDC_EM01CTRL0_IPKVAL_Load52mA                (_DCDC_EM01CTRL0_IPKVAL_Load52mA << 0)          /**< Shifted mode Load52mA for DCDC_EM01CTRL0    */
#define DCDC_EM01CTRL0_IPKVAL_Load56mA                (_DCDC_EM01CTRL0_IPKVAL_Load56mA << 0)          /**< Shifted mode Load56mA for DCDC_EM01CTRL0    */
#define DCDC_EM01CTRL0_IPKVAL_Load60mA                (_DCDC_EM01CTRL0_IPKVAL_Load60mA << 0)          /**< Shifted mode Load60mA for DCDC_EM01CTRL0    */
#define _DCDC_EM01CTRL0_DRVSPEED_SHIFT                8                                               /**< Shift value for DCDC_DRVSPEED               */
#define _DCDC_EM01CTRL0_DRVSPEED_MASK                 0x300UL                                         /**< Bit mask for DCDC_DRVSPEED                  */
#define _DCDC_EM01CTRL0_DRVSPEED_DEFAULT              0x00000001UL                                    /**< Mode DEFAULT for DCDC_EM01CTRL0             */
#define _DCDC_EM01CTRL0_DRVSPEED_DEFAULT_SETTING      0x00000001UL                                    /**< Mode DEFAULT_SETTING for DCDC_EM01CTRL0     */
#define DCDC_EM01CTRL0_DRVSPEED_DEFAULT               (_DCDC_EM01CTRL0_DRVSPEED_DEFAULT << 8)         /**< Shifted mode DEFAULT for DCDC_EM01CTRL0     */
#define DCDC_EM01CTRL0_DRVSPEED_DEFAULT_SETTING       (_DCDC_EM01CTRL0_DRVSPEED_DEFAULT_SETTING << 8) /**< Shifted mode DEFAULT_SETTING for DCDC_EM01CTRL0*/

/* Bit fields for DCDC EM23CTRL0 */
#define _DCDC_EM23CTRL0_RESETVALUE                    0x00000103UL                                    /**< Default value for DCDC_EM23CTRL0            */
#define _DCDC_EM23CTRL0_MASK                          0x0000030FUL                                    /**< Mask for DCDC_EM23CTRL0                     */
#define _DCDC_EM23CTRL0_IPKVAL_SHIFT                  0                                               /**< Shift value for DCDC_IPKVAL                 */
#define _DCDC_EM23CTRL0_IPKVAL_MASK                   0xFUL                                           /**< Bit mask for DCDC_IPKVAL                    */
#define _DCDC_EM23CTRL0_IPKVAL_DEFAULT                0x00000003UL                                    /**< Mode DEFAULT for DCDC_EM23CTRL0             */
#define _DCDC_EM23CTRL0_IPKVAL_Load5mA                0x00000003UL                                    /**< Mode Load5mA for DCDC_EM23CTRL0             */
#define _DCDC_EM23CTRL0_IPKVAL_Load10mA               0x00000009UL                                    /**< Mode Load10mA for DCDC_EM23CTRL0            */
#define DCDC_EM23CTRL0_IPKVAL_DEFAULT                 (_DCDC_EM23CTRL0_IPKVAL_DEFAULT << 0)           /**< Shifted mode DEFAULT for DCDC_EM23CTRL0     */
#define DCDC_EM23CTRL0_IPKVAL_Load5mA                 (_DCDC_EM23CTRL0_IPKVAL_Load5mA << 0)           /**< Shifted mode Load5mA for DCDC_EM23CTRL0     */
#define DCDC_EM23CTRL0_IPKVAL_Load10mA                (_DCDC_EM23CTRL0_IPKVAL_Load10mA << 0)          /**< Shifted mode Load10mA for DCDC_EM23CTRL0    */
#define _DCDC_EM23CTRL0_DRVSPEED_SHIFT                8                                               /**< Shift value for DCDC_DRVSPEED               */
#define _DCDC_EM23CTRL0_DRVSPEED_MASK                 0x300UL                                         /**< Bit mask for DCDC_DRVSPEED                  */
#define _DCDC_EM23CTRL0_DRVSPEED_DEFAULT              0x00000001UL                                    /**< Mode DEFAULT for DCDC_EM23CTRL0             */
#define _DCDC_EM23CTRL0_DRVSPEED_DEFAULT_SETTING      0x00000001UL                                    /**< Mode DEFAULT_SETTING for DCDC_EM23CTRL0     */
#define DCDC_EM23CTRL0_DRVSPEED_DEFAULT               (_DCDC_EM23CTRL0_DRVSPEED_DEFAULT << 8)         /**< Shifted mode DEFAULT for DCDC_EM23CTRL0     */
#define DCDC_EM23CTRL0_DRVSPEED_DEFAULT_SETTING       (_DCDC_EM23CTRL0_DRVSPEED_DEFAULT_SETTING << 8) /**< Shifted mode DEFAULT_SETTING for DCDC_EM23CTRL0*/

/* Bit fields for DCDC BSTCTRL */
#define _DCDC_BSTCTRL_RESETVALUE                      0x00000047UL                                 /**< Default value for DCDC_BSTCTRL              */
#define _DCDC_BSTCTRL_MASK                            0x00000077UL                                 /**< Mask for DCDC_BSTCTRL                       */
#define _DCDC_BSTCTRL_BSTTOFFMAX_SHIFT                0                                            /**< Shift value for DCDC_BSTTOFFMAX             */
#define _DCDC_BSTCTRL_BSTTOFFMAX_MASK                 0x7UL                                        /**< Bit mask for DCDC_BSTTOFFMAX                */
#define _DCDC_BSTCTRL_BSTTOFFMAX_DEFAULT              0x00000007UL                                 /**< Mode DEFAULT for DCDC_BSTCTRL               */
#define _DCDC_BSTCTRL_BSTTOFFMAX_OFF                  0x00000000UL                                 /**< Mode OFF for DCDC_BSTCTRL                   */
#define _DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P35us          0x00000001UL                                 /**< Mode TMAX_0P35us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P63us          0x00000002UL                                 /**< Mode TMAX_0P63us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P91us          0x00000003UL                                 /**< Mode TMAX_0P91us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P19us          0x00000004UL                                 /**< Mode TMAX_1P19us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P47us          0x00000005UL                                 /**< Mode TMAX_1P47us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P75us          0x00000006UL                                 /**< Mode TMAX_1P75us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_BSTTOFFMAX_TMAX_2P03us          0x00000007UL                                 /**< Mode TMAX_2P03us for DCDC_BSTCTRL           */
#define DCDC_BSTCTRL_BSTTOFFMAX_DEFAULT               (_DCDC_BSTCTRL_BSTTOFFMAX_DEFAULT << 0)      /**< Shifted mode DEFAULT for DCDC_BSTCTRL       */
#define DCDC_BSTCTRL_BSTTOFFMAX_OFF                   (_DCDC_BSTCTRL_BSTTOFFMAX_OFF << 0)          /**< Shifted mode OFF for DCDC_BSTCTRL           */
#define DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P35us           (_DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P35us << 0)  /**< Shifted mode TMAX_0P35us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P63us           (_DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P63us << 0)  /**< Shifted mode TMAX_0P63us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P91us           (_DCDC_BSTCTRL_BSTTOFFMAX_TMAX_0P91us << 0)  /**< Shifted mode TMAX_0P91us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P19us           (_DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P19us << 0)  /**< Shifted mode TMAX_1P19us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P47us           (_DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P47us << 0)  /**< Shifted mode TMAX_1P47us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P75us           (_DCDC_BSTCTRL_BSTTOFFMAX_TMAX_1P75us << 0)  /**< Shifted mode TMAX_1P75us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_BSTTOFFMAX_TMAX_2P03us           (_DCDC_BSTCTRL_BSTTOFFMAX_TMAX_2P03us << 0)  /**< Shifted mode TMAX_2P03us for DCDC_BSTCTRL   */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_SHIFT               4                                            /**< Shift value for DCDC_IPKTMAXCTRL            */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_MASK                0x70UL                                       /**< Bit mask for DCDC_IPKTMAXCTRL               */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_DEFAULT             0x00000004UL                                 /**< Mode DEFAULT for DCDC_BSTCTRL               */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_OFF                 0x00000000UL                                 /**< Mode OFF for DCDC_BSTCTRL                   */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P35us         0x00000001UL                                 /**< Mode TMAX_0P35us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P63us         0x00000002UL                                 /**< Mode TMAX_0P63us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P91us         0x00000003UL                                 /**< Mode TMAX_0P91us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P19us         0x00000004UL                                 /**< Mode TMAX_1P19us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P47us         0x00000005UL                                 /**< Mode TMAX_1P47us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P75us         0x00000006UL                                 /**< Mode TMAX_1P75us for DCDC_BSTCTRL           */
#define _DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_2P03us         0x00000007UL                                 /**< Mode TMAX_2P03us for DCDC_BSTCTRL           */
#define DCDC_BSTCTRL_IPKTMAXCTRL_DEFAULT              (_DCDC_BSTCTRL_IPKTMAXCTRL_DEFAULT << 4)     /**< Shifted mode DEFAULT for DCDC_BSTCTRL       */
#define DCDC_BSTCTRL_IPKTMAXCTRL_OFF                  (_DCDC_BSTCTRL_IPKTMAXCTRL_OFF << 4)         /**< Shifted mode OFF for DCDC_BSTCTRL           */
#define DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P35us          (_DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P35us << 4) /**< Shifted mode TMAX_0P35us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P63us          (_DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P63us << 4) /**< Shifted mode TMAX_0P63us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P91us          (_DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_0P91us << 4) /**< Shifted mode TMAX_0P91us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P19us          (_DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P19us << 4) /**< Shifted mode TMAX_1P19us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P47us          (_DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P47us << 4) /**< Shifted mode TMAX_1P47us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P75us          (_DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_1P75us << 4) /**< Shifted mode TMAX_1P75us for DCDC_BSTCTRL   */
#define DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_2P03us          (_DCDC_BSTCTRL_IPKTMAXCTRL_TMAX_2P03us << 4) /**< Shifted mode TMAX_2P03us for DCDC_BSTCTRL   */

